[
  {
    "name": "Accelerated Data Science Teaching Kit for Educators",
    "date": "2021",
    "contents": [
      "Keywords: GPU-accelerated Data Science, RAPIDS, NVIDIA Teaching Kits",
      "The first version of its GPU Accelerated Data Science Teaching Kit for educators.",
      "Presented at NVIDIA's Graphics Technology Conference (<a href='https://www.nvidia.com/en-us/gtc/'>GTC</a>) 2021: Bridging Data Analytics and Machine Learning Skill Gaps with RAPIDS and the New Accelerated Data Science Teaching Kit for University Educators [S31763]",
      "<a href='https://www.nvidia.com/en-us/training/teaching-kits/'><i class='fas fa-globe'></i>Data Science Teaching Kit</a> <a href='https://blogs.nvidia.com/blog/2021/02/25/dli-data-science-teaching-kits/'><i class='fas fa-globe'></i>Blog</a>"
    ]
  },
  {
    "name": "DARPA Guaranteeing AI Robustness against Deception (GARD)",
    "date": "2020-2021",
    "contents": [
      "Keywords: Defenses for Adversarial Examples, Robustness, Defense using Semantic Coherence",
      "We develop defenses for adversarial attacks on object detector for both RGB images and single-camera video. We augment this object detector to support spatial, temporal, semantic coherence in videos."
    ]
  },
  {
    "name": "RAPIDS and Cybersecurity: A Network Use Case",
    "date": "2019",
    "contents": [
      "Keywords: RAPIDS, NVIDIA, GPU-acceleration, Graph, Personalized Page Rank",
      "We showcase an approach to flagging anomalous network communications in a large graph using a combination of structural graph features and graph analytics, running end-to-end in RAPIDS.",
      "Presented at <a href='https://github.com/rapidsai-community/notebooks-contrib/tree/4ee3f2dfb92ee9e947e8d6e06b682fcaa1b2d44b/the_archive/archived_rapids_event_notebooks/KDD_2019/cyber'>cybersecurity use case notebook.</a>"
    ]
  },
  {
    "name": "Recommender System for Videos on Oksusu Application",
    "date": "2017",
    "contents": [
      "Keywords: Deep Learning, Sequence/Word Embedding, Approx. k-NN, Heterogeneous Features",
      "Our system recommends videos to users of Oksusu application, handling massive data on users' behaviors and heterogeneous information of videos.",
      "SK Telecom, Seoul, Republic of Korea"
    ]
  },
  {
    "name": "A Fast Data Compression with Shared Virtual Memory in Heterogeneous System Architecture",
    "date": "2017",
    "contents": [
      "Keywords: OpenCL, GPGPU, SVM, HSA",
      "I used general purpose computing on graphics processing units (GPGPU) and Shared Virtual Memory (SVM) in Heterogeneous System Architecture (HSA) for fast data deduplication methods. GPGPU and HSA provide a powerful basis for parallel computing in an easy programmable and efficient way.",
      "Undergraduate thesis"
    ]
  },
  {
    "name": "Personalized Recommendation for Credit Card Rewards",
    "date": "2016",
    "contents": [
      "Keywords: Coupled Matrix Factorization, Time Series Data",
      "We provide personalized recommendations for credit card rewards to customers using various side information of users and items. The main algorithm is TCMF (Time Coupled Matrix Factorization).",
      "Hyundai Card, Seoul, Republic of Korea",
      "<a href='https://www.mk.co.kr/news/economy/view/2016/12/852499/'><i class='far fa-newspaper'></i>News article (in Korean)</a>"
    ]
  }
]