[
  {
    "name": "NeuroCartography: Scalable Automatic Visual Summarization of Concepts in Deep Neural Networks",
    "date": "2021",
    "contents": [
      "Keywords: Deep Learning Interpretability, Visualization, Human Interpretable Concepts Learned by a Model, Concept Cascade",
      "Interactive visual system that scalably summarizes and visualizes concepts learned by neural networks.",
      "It was published at IEEE Visualization Conference (VIS), 2021.",
      "<u>Haekyu Park</u>, Nilaksh Das, Rahul Duggal, Austin P. Wright, Omar Shaikh, Fred Hohman, Duen Horng Chau",
      "<a href='https://poloclub.github.io/neuro-cartography/'><i class='fas fa-play'></i>Demo</a>"
    ]
  },
  {
    "name": "SkeletonVis: Interactive Visualization for Understanding Adversarial Attacks on Human Action Recognition Models",
    "date": "2021",
    "contents": [
      "Keywords: Adversarial Attacks, Human Action Recognition",
      "Interactive visual system for understanding vulnerability of human action recognition model.",
      "It was published at AAAI Demo, 2021.",
      "<u>Haekyu Park</u>, Zijie J. Wang, Nilaksh Das, Anindya S. Paul, Pruthvi Perumalla, Zhiyan Zhou, Duen Horng Chau",
      "<a href='https://poloclub.github.io/skeleton-vis/'><i class='fas fa-play'></i>Demo</a>"
    ]
  },
  {
    "name": "CNN Explainer: Learning Convolutional Neural Networks with Interactive Visualization",
    "date": "2020",
    "contents": [
      "Keywords: Deep Learning Education, Interactive Visualization, Interactive Animation",
      "Interactive visual system for learning Convolutional Neural Networks.",
      "It was published at IEEE VIS (VAST, TVCG), 2020.",
      "Zijie Jay Wang, Robert Turko, Omar Shaikh, <u>Haekyu Park</u>, Nilaksh Das, Fred Hohman, Minsuk Kahng, Duen Horng (Polo) Chau",
      "<a href='https://poloclub.github.io/cnn-explainer/'><i class='fas fa-play'></i>Demo</a> <a href='https://web.archive.org/web/20200505121955/https://github.com/trending'><i class='fas fa-award'></i>Top of Github Trending</a> <a href='https://github.com/poloclub/cnn-explainer/stargazers'><i class='fas fa-star'></i>4,905 Github stars (as of Oct 2020)</a>"
    ]
  },
  {
    "name": "Bluff: Interactively Deciphering Adversarial Attacks on Deep Neural Networks",
    "date": "2020",
    "contents": [
      "Keywords: Adversarial Attacks, Neural Network Interpretability, Activation Pathways, Interactive Visual Analytics",
      "Interactive system for visualizing, characterizing, and deciphering adversarial attacks on vision-based neural networks.",
      "It was published at IEEE VIS, 2020.",
      "Nilaksh Das*, <u>Haekyu Park</u>*, Zijie Jay Wang, Fred Hohman, Robert Firstman, Emily Rogers, Duen Horng Chau <br>(* Equal Contribution)",
      "<a href='https://poloclub.github.io/bluff'><i class='fas fa-play'></i>Demo</a>"
    ]
  },
  {
    "name": "Summit: Scaling Deep Learning Interpretability by Visualizing Activation and Attribution Summarizations",
    "date": "2019",
    "contents": [
      "Keywords: Neural Network Interpretability, Attribution Graph, Interactive Visual Analytics",
      "Interactive visualization that scalably summarizes what features a deep learning model has learned and how those features interact to make predictions.",
      "It was published at IEEE VIS (VAST, TVCG), 2019.",
      "Fred Hohman, <u>Haekyu Park</u>, Caleb Robinson, Duen Horng Chau",
      "<a href='https://fredhohman.com/summit/'><i class='fas fa-play'></i>Demo</a>"
    ]
  },
  {
    "name": "MLsploit: A Framework for Interactive Experimentation with Adversarial Machine Learning Research",
    "date": "2019",
    "contents": [
      "Keywords: Adversarial Attacks and Defenses for Machine Learning Models, Interactive Experimentation",
      "User-friendly, cloud-based system that enables researchers and practitioners to rapidly evaluate and compare state-of-the-art adversarial attacks and defenses for machine learning (ML) models. ",
      "It was published at a KDD 2019 Project Showcase.",
      "<a href='https://mlsploit.github.io'><i class='fas fa-play'></i>Demo</a>"
    ]
  },
  {
    "name": "SIDE: Representation Learning in Signed Directed Networks",
    "date": "2018",
    "contents": [
      "Keywords: Network Embedding, Signed Weighted Directed Graph",
      "General network embedding method that represents both sign and direction of edges in the embedding space.",
      "It was published at the Web Conference (WWW), 2018.",
      "<a href='https://datalab.snu.ac.kr/side/'><i class='fas fa-globe'></i>Webpage</a>"
    ]
  },
  {
    "name": "A Comparative Study of Matrix Factorization and Random Walk with Restart in Recommender Systems",
    "date": "2017",
    "contents": [
      "Keywords: Recommender System, Matrix Factorization (MF), Random Walk with Restart (RWR)",
      "We provide a comparative study of MF and RWR, which are the most representative methods for recommender systems.",
      "It was published at IEEE Big Data, 2017.",
      "<a href='https://datalab.snu.ac.kr/mfrwr/'><i class='fas fa-globe'></i>Webpage</a>"
    ]
  }
]